# GetRodLength Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationRodInfo..::..GetRodLength Method
FabricationRodInfo Class See Also
---
Get the current rod length. If the rod is the length will include structural extension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double GetRodLength(
	int rodIndex
)
```

Visual Basic
---
```text
Public Function GetRodLength ( _
	rodIndex As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetRodLength(
	int rodIndex
)
```

# ### Parameters
rodIndex
    Type: System..::..Int32 The rod index.
# ### Return Value
Returns rod length of hanger for specified end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace